{
	"pluginmetadataversion":2,
	"name":"Native Predicate Solver",
	"type":[
		"helper"
	],
	"api":[
		"python3"
	],
	"description":"Remove opaque predicates from binaries",
	"longdescription":"This plugin removes conditional branches that always evaluate to the same value. Written in C++ for speed - faster than the Python version, especially on large binaries. Uses multiple threads to process functions in parallel, and will iteratively perform passes through functions to clean up newly uncovered opaque predicates.\n\n## Features\n\n- Fast native C++ implementation\n- Multi-threaded parallel processing\n- Iterative analysis to catch nested predicates\n- Works on individual functions or entire binaries\n- Configurable pass limits and thread count\n\n## Example\n\n### Before:\n![Before example](https://github.com/ScriptWare-Software/native-predicate-solver/blob/master/img/before.png?raw=true)\n\n### After:\n![After example](https://github.com/ScriptWare-Software/native-predicate-solver/blob/master/img/after.png?raw=true)\n\nThis plugin serves as a loader for the [native C++ plugin](https://github.com/ScriptWare-Software/native-predicate-solver).",
	"license":{
		"name":"MIT",
		"text":"MIT License\n\nCopyright (c) 2025 Script-Ware Software\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
	},
	"platforms":[
		"Windows",
		"Linux",
		"Darwin"
	],
	"installinstructions":{
		"Windows":"The plugin will automatically download and install the native component.",
		"Linux":"The plugin will automatically download and install the native component.",
		"Darwin":"The plugin will automatically download and install the native component."
	},
	"dependencies":{
		"pip":[
			"requests",
			"bs4"
		]
	},
	"version":"1.0.1",
	"author":"ScriptWare Software",
	"minimumbinaryninjaversion":4100
}
